; ModuleID = 'triad.llvm'
source_filename = "triad.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [12 x i8] c"output.data\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"%d,\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@.str.4 = private constant [6 x i8] c"triad\00"
@.str.5 = private constant [4 x i8] c"0:0\00"
@.str.6 = private constant [6 x i8] c"0:0-5\00"
@.str.7 = private constant [4 x i8] c"1:1\00"
@.str.8 = private constant [4 x i8] c"phi\00"
@.str.9 = private constant [11 x i8] c"indvars.iv\00"
@.str.10 = private constant [16 x i8] c"indvars.iv.next\00"
@.str.11 = private constant [1 x i8] zeroinitializer
@.str.12 = private constant [9 x i8] c"arrayidx\00"
@.str.13 = private constant [2 x i8] c"a\00"
@.str.14 = private constant [2 x i8] c"2\00"
@.str.15 = private constant [10 x i8] c"arrayidx2\00"
@.str.16 = private constant [2 x i8] c"b\00"
@.str.17 = private constant [2 x i8] c"3\00"
@.str.18 = private constant [4 x i8] c"mul\00"

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "triad.c", directory: "/workspace/gem5-aladdin/src/aladdin/SHOC/triad")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{i32 2, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 6.0.0 (tags/RELEASE_600/final)"}
!10 = distinct !DISubprogram(name: "triad", scope: !1, file: !1, line: 7, type: !11, isLocal: false, isDefinition: true, scopeLine: 7, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !13)
!11 = !DISubroutineType(types: !12)
!12 = !{null, !4, !4, !4, !5}
!13 = !{!14, !15, !16, !17, !18}
!14 = !DILocalVariable(name: "a", arg: 1, scope: !10, file: !1, line: 7, type: !4)
!15 = !DILocalVariable(name: "b", arg: 2, scope: !10, file: !1, line: 7, type: !4)
!16 = !DILocalVariable(name: "c", arg: 3, scope: !10, file: !1, line: 7, type: !4)
!17 = !DILocalVariable(name: "s", arg: 4, scope: !10, file: !1, line: 7, type: !5)
!18 = !DILocalVariable(name: "i", scope: !10, file: !1, line: 14, type: !5)
!19 = !DILocation(line: 7, column: 17, scope: !10)
!20 = !DILocation(line: 7, column: 24, scope: !10)
!21 = !DILocation(line: 7, column: 32, scope: !10)
!22 = !DILocation(line: 7, column: 39, scope: !10)
!23 = !DILocation(line: 14, column: 7, scope: !10)
!24 = !DILocation(line: 15, column: 9, scope: !25)
!25 = distinct !DILexicalBlock(scope: !10, file: !1, line: 15, column: 9)
!26 = !DILocation(line: 16, column: 12, scope: !27)
!27 = distinct !DILexicalBlock(scope: !25, file: !1, line: 15, column: 9)
!28 = !{!29, !29, i64 0}
!29 = !{!"int", !30, i64 0}
!30 = !{!"omnipotent char", !31, i64 0}
!31 = !{!"Simple C/C++ TBAA"}
!32 = !DILocation(line: 16, column: 21, scope: !27)
!33 = !DILocation(line: 16, column: 20, scope: !27)
!34 = !DILocation(line: 16, column: 17, scope: !27)
!35 = !DILocation(line: 16, column: 5, scope: !27)
!36 = !DILocation(line: 16, column: 10, scope: !27)
!37 = !DILocation(line: 15, column: 24, scope: !27)
!38 = !DILocation(line: 15, column: 18, scope: !27)
!39 = distinct !{!39, !24, !40}
!40 = !DILocation(line: 16, column: 24, scope: !25)
!41 = !DILocation(line: 21, column: 1, scope: !10)
!42 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 23, type: !43, isLocal: false, isDefinition: true, scopeLine: 23, isOptimized: true, unit: !0, variables: !45)
!43 = !DISubroutineType(types: !44)
!44 = !{!5}
!45 = !{!46, !47, !48, !49, !50}
!46 = !DILocalVariable(name: "a", scope: !42, file: !1, line: 24, type: !4)
!47 = !DILocalVariable(name: "b", scope: !42, file: !1, line: 24, type: !4)
!48 = !DILocalVariable(name: "c", scope: !42, file: !1, line: 24, type: !4)
!49 = !DILocalVariable(name: "i", scope: !42, file: !1, line: 28, type: !5)
!50 = !DILocalVariable(name: "output", scope: !42, file: !1, line: 42, type: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !53, line: 7, baseType: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "/workspace/gem5-aladdin/src/aladdin/SHOC/triad")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 245, size: 1728, elements: !56)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "/workspace/gem5-aladdin/src/aladdin/SHOC/triad")
!56 = !{!57, !58, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !79, !80, !81, !82, !86, !88, !90, !94, !97, !99, !101, !102, !103, !104, !108, !109}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 246, baseType: !5, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 251, baseType: !59, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 252, baseType: !59, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 253, baseType: !59, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 255, baseType: !59, size: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 256, baseType: !59, size: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 257, baseType: !59, size: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 258, baseType: !59, size: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 260, baseType: !59, size: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 262, baseType: !59, size: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 264, baseType: !72, size: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 160, size: 192, elements: !74)
!74 = !{!75, !76, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !73, file: !55, line: 161, baseType: !72, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !73, file: !55, line: 162, baseType: !77, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !73, file: !55, line: 166, baseType: !5, size: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 266, baseType: !77, size: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 268, baseType: !5, size: 32, offset: 896)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 272, baseType: !5, size: 32, offset: 928)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 274, baseType: !83, size: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !84, line: 140, baseType: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/workspace/gem5-aladdin/src/aladdin/SHOC/triad")
!85 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 278, baseType: !87, size: 16, offset: 1024)
!87 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 279, baseType: !89, size: 8, offset: 1040)
!89 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 280, baseType: !91, size: 8, offset: 1048)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 1)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 284, baseType: !95, size: 64, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 154, baseType: null)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 293, baseType: !98, size: 64, offset: 1152)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !84, line: 141, baseType: !85)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 301, baseType: !100, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 302, baseType: !100, size: 64, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 303, baseType: !100, size: 64, offset: 1344)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 304, baseType: !100, size: 64, offset: 1408)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 306, baseType: !105, size: 64, offset: 1472)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !106, line: 62, baseType: !107)
!106 = !DIFile(filename: "/usr/local/lib/clang/6.0.0/include/stddef.h", directory: "/workspace/gem5-aladdin/src/aladdin/SHOC/triad")
!107 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 307, baseType: !5, size: 32, offset: 1536)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 309, baseType: !110, size: 160, offset: 1568)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 160, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 20)
!113 = !DILocation(line: 25, column: 17, scope: !42)
!114 = !DILocation(line: 25, column: 9, scope: !42)
!115 = !DILocation(line: 24, column: 7, scope: !42)
!116 = !DILocation(line: 26, column: 17, scope: !42)
!117 = !DILocation(line: 26, column: 9, scope: !42)
!118 = !DILocation(line: 24, column: 11, scope: !42)
!119 = !DILocation(line: 27, column: 17, scope: !42)
!120 = !DILocation(line: 27, column: 9, scope: !42)
!121 = !DILocation(line: 24, column: 15, scope: !42)
!122 = !DILocation(line: 29, column: 9, scope: !42)
!123 = !DILocation(line: 29, column: 3, scope: !42)
!124 = !DILocation(line: 28, column: 6, scope: !42)
!125 = !DILocation(line: 30, column: 2, scope: !126)
!126 = distinct !DILexicalBlock(scope: !42, file: !1, line: 30, column: 2)
!127 = !DILocation(line: 31, column: 3, scope: !128)
!128 = distinct !DILexicalBlock(scope: !129, file: !1, line: 30, column: 22)
!129 = distinct !DILexicalBlock(scope: !126, file: !1, line: 30, column: 2)
!130 = !DILocation(line: 31, column: 8, scope: !128)
!131 = !DILocation(line: 32, column: 10, scope: !128)
!132 = !DILocation(line: 32, column: 3, scope: !128)
!133 = !DILocation(line: 32, column: 8, scope: !128)
!134 = !DILocation(line: 33, column: 10, scope: !128)
!135 = !DILocation(line: 33, column: 3, scope: !128)
!136 = !DILocation(line: 33, column: 8, scope: !128)
!137 = !DILocation(line: 30, column: 19, scope: !129)
!138 = !DILocation(line: 30, column: 12, scope: !129)
!139 = distinct !{!139, !125, !140}
!140 = !DILocation(line: 34, column: 2, scope: !126)
!141 = !DILocation(line: 38, column: 2, scope: !42)
!142 = !DILocation(line: 43, column: 12, scope: !42)
!143 = !DILocation(line: 42, column: 9, scope: !42)
!144 = !DILocation(line: 44, column: 2, scope: !145)
!145 = distinct !DILexicalBlock(scope: !42, file: !1, line: 44, column: 2)
!146 = !DILocation(line: 45, column: 28, scope: !147)
!147 = distinct !DILexicalBlock(scope: !145, file: !1, line: 44, column: 2)
!148 = !DILocation(line: 45, column: 5, scope: !147)
!149 = !DILocation(line: 44, column: 19, scope: !147)
!150 = !DILocation(line: 44, column: 12, scope: !147)
!151 = distinct !{!151, !144, !152}
!152 = !DILocation(line: 45, column: 32, scope: !145)
!153 = !DILocation(line: 46, column: 3, scope: !42)
!154 = !DILocation(line: 47, column: 3, scope: !42)
!155 = !DILocation(line: 48, column: 2, scope: !42)
